<------ <Базовая настройка> ------>
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R1
R1(config)#service passw
R1(config)#service password-encryption 
R1(config)#enable secret class
R1(config)#banner motd #Get out!!!#
R1(config)#no ip domain-lookup
R1(config)#line con 0
R1(config-line)#password cisco
R1(config-line)#logging synchronous
R1(config-line)#login
R1(config-line)#exit
R1(config)#ip domain-name Rt1
R1(config)#crypto key generate rsa
The name for the keys will be: R1.Rt1
Choose the size of the key modulus in the range of 360 to 2048 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...[OK]


<------ <Настройка ssh> ------>
R1(config)#line vty 0 4
*Mar 1 0:52:42.204: %SSH-5-ENABLED: SSH 1.99 has been enabled

R1(config-line)#transport input ssh
R1(config-line)#login local
R1(config-line)#exit
R1(config)#ip ssh version 2
R1(config)#ip ssh authentication-retries 3
R1(config)#ip ssh time-out 120
R1(config)#


<------ <Настройка ipv6> ------>
Press RETURN to get started.

Get out!!!

User Access Verification

Password: 

R1>en
Password: 
R1#conf t
R1(config)#interface GigabitEthernet 0/0/0
R1(config-if)#ipv6 address fe80::1 link-local
R1(config-if)#no shutdown 
R1(config-if)#exit
R1(config)#interface GigabitEthernet 0/0/1
R1(config-if)#ipv6 address fe80::1 link-local
R1(config-if)#no shutdown
R1(config-if)#end
R1#
%SYS-5-CONFIG_I: Configured from console by console

R1#show ipv6 inter
R1#show ipv6 interface br
GigabitEthernet0/0/0       [up/up]
    FE80::1
GigabitEthernet0/0/1       [up/up]
    FE80::1
GigabitEthernet0/0/2       [administratively down/down]
    unassigned
Vlan1                      [administratively down/down]
    unassigned
R1#




R1(config-if)#ipv6 address 2001:db8:acad:a::1/64

R1(config-if)#ipv6 address 2001:db8:acad:1::1/64