

<------ <Базовая настройка> ------>
Switch>
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname S1
S1(config)#service password-encryption 
S1(config)#enable secret class
S1(config)#banner motd #Get out!!!#
S1(config)#no ip domain-lookup
S1(config)#line con 0
S1(config-line)#password cisco
S1(config-line)#logging synchronous 
S1(config-line)#login
S1(config-line)#exit
S1(config)#line vty 0 4
S1(config-line)#password cisco
S1(config-line)#login
S1(config-line)#exit
S1(config)#
S1(config)#ip domain-name sw1
S1(config)#crypto key generate rsa
The name for the keys will be: S1.sw1
Choose the size of the key modulus in the range of 360 to 2048 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...[OK]


<------ <Настройка ssh> ------>
S1(config)#line vty 0 4
*Mar 1 0:17:56.272: %SSH-5-ENABLED: SSH 1.99 has been enabled
S1(config-line)#transport input ssh 
S1(config-line)#login local
S1(config-line)#exit
S1(config)#ip ssh version 2
S1(config)#ip ssh authentication-retries 3
S1(config)#ip ssh time-out 120


<------ <Настройка SDM> ------>
S1(config)#sdm prefer dual-ipv4-and-ipv6 default 
Changes to the running SDM preferences have been stored, but cannot take effect until the next reload.
Use 'show sdm prefer' to see what SDM preference is currently active.
S1(config)#do write memory
Building configuration...
[OK]
S1(config)#do reload

<------ <omitted> ------>

Press RETURN to get started!

Get out!!!

User Access Verification

Password: 

S1>en
Password: 
S1#show sdm prefer 
 The current template is "dual-ipv4-and-ipv6 default" template.
 
<------ <omitted> ------>

S1#


